apache/nuttx/arch/arm/src/lpc43xx/lpc43_ethernet.c
/****************************************************************************
 * arch/arm/src/lpc43xx/lpc43_ethernet.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#if defined(CONFIG_NET) && defined(CONFIG_LPC43_ETHERNET)

#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <time.h>
#include <string.h>
#include <assert.h>
#include <nuttx/debug.h>
#include <errno.h>

#include <arpa/inet.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/queue.h>
#include <nuttx/wdog.h>
#include <nuttx/wqueue.h>
#include <nuttx/net/mii.h>
#include <nuttx/net/ip.h>
#include <nuttx/net/netdev.h>

#if defined(CONFIG_NET_PKT)
#  include <nuttx/net/pkt.h>
#endif

#include "arm_internal.h"
#include "chip.h"
#include "lpc43_pinconfig.h"
#include "lpc43_ethernet.h"
#include "hardware/lpc43_creg.h"
#include "hardware/lpc43_cgu.h"
#include "hardware/lpc43_ccu.h"
#include "lpc43_rgu.h"
#include "lpc43_gpio.h"

#include <arch/board/board.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

/* If processing is not done at the interrupt level, then work queue support
 * is required.
 */

#if !defined(CONFIG_SCHED_WORKQUEUE)
#  error Work queue support is required
#endif

/* The low priority work queue is preferred.  If it is not enabled, LPWORK
 * will be the same as HPWORK.
 *
 * NOTE:  However, the network should NEVER run on the high priority work
 * queue!  That queue is intended only to service short back end interrupt
 * processing that never suspends.  Suspending the high priority work queue
 * may bring the system to its knees!
 */

#define ETHWORK LPWORK

#ifndef CONFIG_LPC43_PHYADDR
#  error "CONFIG_LPC43_PHYADDR must be defined in the NuttX configuration"
#endif

#if !defined(CONFIG_LPC43_MII) && !defined(CONFIG_LPC43_RMII)
#  warning "Neither CONFIG_LPC43_MII nor CONFIG_LPC43_RMII defined"
#endif

#if defined(CONFIG_LPC43_MII) && defined(CONFIG_LPC43_RMII)
#  error "Both CONFIG_LPC43_MII and CONFIG_LPC43_RMII defined"
#endif

#ifdef CONFIG_LPC43_AUTONEG
#  ifndef CONFIG_LPC43_PHYSR
#    error "CONFIG_LPC43_PHYSR must be defined in the NuttX configuration"
#  endif
#  ifdef CONFIG_LPC43_PHYSR_ALTCONFIG
#    ifndef CONFIG_LPC43_PHYSR_ALTMODE
#      error "CONFIG_LPC43_PHYSR_ALTMODE must be defined in the NuttX configuration"
#    endif
#    ifndef CONFIG_LPC43_PHYSR_10HD
#      error "CONFIG_LPC43_PHYSR_10HD must be defined in the NuttX configuration"
#    endif
#    ifndef CONFIG_LPC43_PHYSR_100HD
#      error "CONFIG_LPC43_PHYSR_100HD must be defined in the NuttX configuration"
#    endif
#    ifndef CONFIG_LPC43_PHYSR_10FD
#      error "CONFIG_LPC43_PHYSR_10FD must be defined in the NuttX configuration"
#    endif
#    ifndef CONFIG_LPC43_PHYSR_100FD
#      error "CONFIG_LPC43_PHYSR_100FD must be defined in the NuttX configuration"
#    endif
#  else
#    ifndef CONFIG_LPC43_PHYSR_SPEED
#      error "CONFIG_LPC43_PHYSR_SPEED must be defined in the NuttX configuration"
#    endif
#    ifndef CONFIG_LPC43_PHYSR_100MBPS
#      error "CONFIG_LPC43_PHYSR_100MBPS must be defined in the NuttX configuration"
#    endif
#    ifndef CONFIG_LPC43_PHYSR_MODE
#      error "CONFIG_LPC43_PHYSR_MODE must be defined in the NuttX configuration"
#    endif
#    ifndef CONFIG_LPC43_PHYSR_FULLDUPLEX
#      error "CONFIG_LPC43_PHYSR_FULLDUPLEX must be defined in the NuttX configuration"
#    endif
#  endif
#endif

#ifdef CONFIG_LPC43_ETH_PTP
#  warning "CONFIG_LPC43_ETH_PTP is not yet supported"
#endif

/* This driver does not use enhanced descriptors.  Enhanced descriptors must
 * be used, however, if time stamping or and/or IPv4 checksum offload is
 * supported.
 */

#undef CONFIG_LPC43_ETH_ENHANCEDDESC
#undef CONFIG_LPC43_ETH_HWCHECKSUM

/* Add 4 to the configured buffer size to account for the 2 byte checksum
 * memory needed at the end of the maximum size packet.  Buffer sizes must
 * be an even multiple of 4, 8, or 16 bytes (depending on buswidth).  We
 * will use the 16-byte alignment in all cases.
 */

#define OPTIMAL_ETH_BUFSIZE ((CONFIG_NET_ETH_PKTSIZE + 4 + 15) & ~15)

#ifndef CONFIG_LPC43_ETH_BUFSIZE
#  define CONFIG_LPC43_ETH_BUFSIZE OPTIMAL_ETH_BUFSIZE
#endif

#if CONFIG_LPC43_ETH_BUFSIZE > ETH_TDES1_TBS1_MASK
#  error "CONFIG_LPC43_ETH_BUFSIZE is too large"
#endif

#if (CONFIG_LPC43_ETH_BUFSIZE & 15) != 0
#  error "CONFIG_LPC43_ETH_BUFSIZE must be aligned"
#endif

#if CONFIG_LPC43_ETH_BUFSIZE != OPTIMAL_ETH_BUFSIZE
#  warning "You using an incomplete/untested configuration"
#endif

#ifndef CONFIG_LPC43_ETH_NRXDESC
#  define CONFIG_LPC43_ETH_NRXDESC 8
#endif
#ifndef CONFIG_LPC43_ETH_NTXDESC
#  define CONFIG_LPC43_ETH_NTXDESC 4
#endif

/* We need at least one more free buffer than transmit buffers */

#define LPC43_ETH_NFREEBUFFERS (CONFIG_LPC43_ETH_NTXDESC+1)

