apache/nuttx/arch/arm/src/lpc43xx/lpc43_ethernet.c
/* Extremely detailed register debug that you would normally never want
 * enabled.
 */

#ifndef CONFIG_DEBUG_NET_INFO
#  undef CONFIG_LPC43_ETHMAC_REGDEBUG
#endif

/* Clocking *****************************************************************/

/* Set MACMIIAR CR bits depending on HCLK setting */

#if BOARD_FCLKOUT_FREQUENCY >= 20000000 && BOARD_FCLKOUT_FREQUENCY < 35000000
#  define ETH_MACMIIA_CR ETH_MACMIIA_CR_20_35
#elif BOARD_FCLKOUT_FREQUENCY >= 35000000 && BOARD_FCLKOUT_FREQUENCY < 60000000
#  define ETH_MACMIIA_CR ETH_MACMIIA_CR_35_60
#elif BOARD_FCLKOUT_FREQUENCY >= 60000000 && BOARD_FCLKOUT_FREQUENCY < 100000000
#  define ETH_MACMIIA_CR ETH_MACMIIA_CR_60_100
#elif BOARD_FCLKOUT_FREQUENCY >= 100000000 && BOARD_FCLKOUT_FREQUENCY < 150000000
#  define ETH_MACMIIA_CR ETH_MACMIIA_CR_100_150
#elif BOARD_FCLKOUT_FREQUENCY >= 150000000 && BOARD_FCLKOUT_FREQUENCY <= 250000000
#  define ETH_MACMIIA_CR ETH_MACMIIA_CR_150_250
#elif BOARD_FCLKOUT_FREQUENCY >= 250000000 && BOARD_FCLKOUT_FREQUENCY <= 350000000
#  define ETH_MACMIIA_CR ETH_MACMIIA_CR_250_300
#else
#  error "BOARD_FCLKOUT_FREQUENCY not supportable"
#endif

/* Timing *******************************************************************/

/* TX timeout = 1 minute */

#define LPC43_TXTIMEOUT   (60*CLK_TCK)

/* PHY reset/configuration delays in milliseconds */

#define PHY_RESET_DELAY   (65)
#define PHY_CONFIG_DELAY  (1000)

/* PHY read/write delays in loop counts */

#define PHY_READ_TIMEOUT  (0x0004ffff)
#define PHY_WRITE_TIMEOUT (0x0004ffff)
#define PHY_RETRY_TIMEOUT (0x0004ffff)

/* Register values **********************************************************/

/* Clear the MACCR bits that will be setup during MAC initialization (or that
 * are cleared unconditionally).  Per the reference manual, all reserved bits
 * must be retained at their reset value.
 *
 * ETH_MACCFG_RE    Bit 2:  Receiver enable
 * ETH_MACCFG_TE   Bit 3:  Transmitter enable
 * ETH_MACCFG_DC   Bit 4:  Deferral check
 * ETH_MACCFG_BL   Bits 5-6: Back-off limit
 * ETH_MACCFG_APCS Bit 7:  Automatic pad/CRC stripping
 * ETH_MACCFG_RD   Bit 9:  Retry disable
 * ETH_MACCFG_DM   Bit 11: Duplex mode
 * ETH_MACCFG_LM   Bit 12: Loopback mode
 * ETH_MACCFG_DO   Bit 13: Receive own disable
 * ETH_MACCFG_FES  Bit 14: Fast Ethernet speed
 * ETH_MACCFG_CSD  Bit 16: Carrier sense disable
 * ETH_MACCFG_IFG  Bits 17-19: Interframe gap
 * ETH_MACCFG_JD   Bit 22: Jabber disable
 * ETH_MACCFG_WD   Bit 23: Watchdog disable
 * ETH_MACCFG_CSTF Bits 25: CRC stripping for Type frames (F2/F4 only)
 */

#define MACCR_CLEAR_BITS \
  (ETH_MACCFG_RE | ETH_MACCFG_TE | ETH_MACCFG_DF | ETH_MACCFG_BL_MASK | \
   ETH_MACCFG_ACS | ETH_MACCFG_RD | ETH_MACCFG_DM | \
   ETH_MACCFG_LM | ETH_MACCFG_DO | ETH_MACCFG_FES | ETH_MACCFG_DCRS | \
   ETH_MACCFG_JE | ETH_MACCFG_IFG_MASK | ETH_MACCFG_JD | ETH_MACCFG_WD)

/* The following bits are set or left zero unconditionally in all modes.
 *
 * ETH_MACCFG_RE   Receiver enable               0 (disabled)
 * ETH_MACCFG_TE   Transmitter enable            0 (disabled)
 * ETH_MACCFG_DC   Deferral check                0 (disabled)
 * ETH_MACCFG_BL   Back-off limit                0 (10)
 * ETH_MACCFG_APCS Automatic pad/CRC stripping   0 (disabled)
 * ETH_MACCFG_RD   Retry disable                 1 (disabled)
 * ETH_MACCFG_LM   Loopback mode                 0 (disabled)
 * ETH_MACCFG_ROD  Receive own disable           0 (enabled)
 * ETH_MACCFG_CSD  Carrier sense disable         0 (enabled)
 * ETH_MACCFG_IFG  Interframe gap                0 (96 bits)
 * ETH_MACCFG_JD   Jabber disable                0 (enabled)
 * ETH_MACCFG_WD   Watchdog disable              0 (enabled)
 * ETH_MACCFG_CSTF CRC stripping for Type frames 0 (disabled, F2/F4 only)
 *
 * The following are set conditioinally based on mode and speed.
 *
 * ETH_MACCFG_DM   Duplex mode                   Depends on priv->fduplex
 * ETH_MACCFG_FES  Fast Ethernet speed           Depends on priv->mbps100
 */

#  define MACCR_SET_BITS \
     (ETH_MACCFG_BL_10 | ETH_MACCFG_RD | ETH_MACCFG_IFG(96))

/* Clear the MACCR bits that will be setup during MAC initialization (or that
 * are cleared unconditionally).  Per the reference manual, all reserved bits
 * must be retained at their reset value.
 *
 * ETH_MACFFR_PM   Bit 0: Promiscuous mode
 * ETH_MACFFR_HU   Bit 1: Hash unicast
 * ETH_MACFFR_HM   Bit 2: Hash multicast
 * ETH_MACFFR_DAIF Bit 3: Destination address inverse filtering
 * ETH_MACFFR_PAM  Bit 4: Pass all multicast
 * ETH_MACFFR_BFD  Bit 5: Broadcast frames disable
 * ETH_MACFFR_PCF  Bits 6-7: Pass control frames
 * ETH_MACFFR_SAIF Bit 8: Source address inverse filtering
 * ETH_MACFFR_SAF  Bit 9: Source address filter
 * ETH_MACFFR_HPF  Bit 10: Hash or perfect filter
 * ETH_MACFFR_RA   Bit 31: Receive all
 */

#define MACFFR_CLEAR_BITS \
  (ETH_MACFFLT_PR | ETH_MACFFLT_HUC | ETH_MACFFLT_HMC | ETH_MACFFLT_DAIF | \
   ETH_MACFFLT_PM | ETH_MACFFLT_DBF | ETH_MACFFLT_PCF_MASK | ETH_MACFFLT_HPF | \
   ETH_MACFFLT_RA)

/* The following bits are set or left zero unconditionally in all modes.
 *
 * ETH_MACFFLT_PM   Promiscuous mode         0 (disabled)
 * ETH_MACFFLT_HU   Hash unicast             0 (perfect dest filtering)
 * ETH_MACFFLT_HM   Hash multicast           0 (perfect dest filtering)
 * ETH_MACFFLT_DAIF Destination address      0 (normal)
 *                  inverse filtering
 * ETH_MACFFLT_PAM  Pass all multicast       0 (Depends on HM bit)
 * ETH_MACFFLT_BFD  Broadcast frames disable 0 (enabled)
 * ETH_MACFFLT_PCF  Pass control frames      1 (block all but PAUSE)
 * ETH_MACFFLT_HPF  Hash or perfect filter   0 (Only matching frames passed)
 * ETH_MACFFLT_RA   Receive all              0 (disabled)
 */

#define MACFFR_SET_BITS (ETH_MACFFLT_PCF_PAUSE)

/* Clear the MACFCR bits that will be setup during MAC initialization (or
 * that are cleared unconditionally). Per the reference manual, all reserved
 * bits must be retained at their reset value.
 *
 * ETH_MACFCR_FCB_BPA Bit 0: Flow control busy/back pressure activate
 * ETH_MACFCR_TFCE    Bit 1: Transmit flow control enable
 * ETH_MACFCR_RFCE    Bit 2: Receive flow control enable
 * ETH_MACFCR_UPFD    Bit 3: Unicast pause frame detect
 * ETH_MACFCR_PLT     Bits 4-5: Pause low threshold
 * ETH_MACFCR_ZQPD    Bit 7: Zero-quanta pause disable
 * ETH_MACFCR_PT      Bits 16-31: Pause time
 */

#define MACFCR_CLEAR_MASK \
  (ETH_MACFC_FCB | ETH_MACFC_TFE | ETH_MACFC_RFE | ETH_MACFC_UP | \
   ETH_MACFC_PLT_MASK | ETH_MACFC_DZPQ | ETH_MACFC_PT_MASK)

/* The following bits are set or left zero unconditionally in all modes.
 *
 * ETH_MACFCR_FCB_BPA Flow control busy/back       0 (no pause control frame)
 *                    activate pressure
 * ETH_MACFCR_TFCE    Transmit flow control enable 0 (disabled)
 * ETH_MACFCR_RFCE    Receive flow control enable  0 (disabled)
 * ETH_MACFCR_UPFD    Unicast pause frame detect   0 (disabled)
 * ETH_MACFCR_PLT     Pause low threshold          0 (pause time - 4)
 * ETH_MACFCR_ZQPD    Zero-quanta pause disable    1 (disabled)
 * ETH_MACFCR_PT      Pause time                   0
 */

#define MACFCR_SET_MASK (ETH_MACFC_PLT(4) | ETH_MACFC_DZPQ)

/* Clear the DMAOMR bits that will be setup during MAC initialization (or
 * that are cleared unconditionally). Per the reference manual, all reserved
 * bits must be retained at their reset value.
 *
 * ETH_DMAOPMODE_SR   Bit 1:  Start/stop receive
 * TH_DMAOMR_OSF      Bit 2:  Operate on second frame
 * ETH_DMAOPMODE_RTC  Bits 3-4: Receive threshold control
 * ETH_DMAOPMODE_FUGF Bit 6:  Forward undersized good frames
 * ETH_DMAOPMODE_FEF  Bit 7:  Forward error frames
 * ETH_DMAOPMODE_ST   Bit 13: Start/stop transmission
 * ETH_DMAOPMODE_TTC  Bits 14-16: Transmit threshold control
 * ETH_DMAOPMODE_FTF  Bit 20: Flush transmit FIFO
 * ETH_DMAOPMODE_TSF  Bit 21: Transmit store and forward
 * ETH_DMAOPMODE_DFRF Bit 24: Disable flushing of received frames
 * ETH_DMAOPMODE_RSF  Bit 25: Receive store and forward
 * TH_DMAOMR_DTCEFD   Bit 26: Dropping of TCP/IP checksum error
 *                            frames disable
 */

#define DMAOMR_CLEAR_MASK \
  (ETH_DMAOPMODE_SR | ETH_DMAOPMODE_OSF | ETH_DMAOPMODE_RTC_MASK | ETH_DMAOPMODE_FUF | \
   ETH_DMAOPMODE_FEF | ETH_DMAOPMODE_ST | ETH_DMAOPMODE_TTC_MASK | ETH_DMAOPMODE_FTF | \
   ETH_DMAOPMODE_DFF)

/* The following bits are set or left zero unconditionally in all modes.
 *
 * ETH_DMAOPMODE_SR   Start/stop receive          0 (not running)
 * TH_DMAOMR_OSF      Operate on second frame     1 (enabled)
 * ETH_DMAOPMODE_RTC  Receive threshold control   0 (64 bytes)
 * ETH_DMAOPMODE_FUGF Forward undersized good     0 (disabled)
 *                    frames
 * ETH_DMAOPMODE_FEF  Forward error frames        0 (disabled)
 * ETH_DMAOPMODE_ST   Start/stop transmission     0 (not running)
 * ETH_DMAOPMODE_TTC  Transmit threshold control  0 (64 bytes)
 * ETH_DMAOPMODE_FTF  Flush transmit FIFO         0 (no flush)
 * ETH_DMAOPMODE_TSF  Transmit store and forward  Depends on
 *                                                CONFIG_LPC43_ETH_HWCHECKSUM
 * ETH_DMAOPMODE_DFRF Disable flushing of         0 (enabled)
 *                    received frames
 * ETH_DMAOPMODE_RSF  Receive store and forward   Depends on
 *                                                CONFIG_LPC43_ETH_HWCHECKSUM
 * TH_DMAOMR_DTCEFD   Dropping of TCP/IP checksum Depends on
 *                    error frames disable        CONFIG_LPC43_ETH_HWCHECKSUM
 *
 * When the checksum offload feature is enabled, we need to enable the Store
 * and Forward mode: the store and forward guarantee that a whole frame is
 * stored in the FIFO, so the MAC can insert/verify the checksum, if the
 * checksum is OK the DMA can handle the frame otherwise the frame is dropped
 */

#ifdef CONFIG_LPC43_ETH_HWCHECKSUM
#  define DMAOMR_SET_MASK \
    (ETH_DMAOPMODE_OSF | ETH_DMAOPMODE_RTC_64 | ETH_DMAOPMODE_TTC_64 | \
     ETH_DMAOPMODE_TSF | ETH_DMAOPMODE_RSF)
#else
#  define DMAOMR_SET_MASK \
    (ETH_DMAOPMODE_OSF | ETH_DMAOPMODE_RTC_64 | ETH_DMAOPMODE_TTC_64)
#endif

/* Clear the DMABMR bits that will be setup during MAC initialization (or
 * that are cleared unconditionally). Per the reference manual, all reserved
 * bits must be retained at their reset value.
 *
 * ETH_DMABMODE_SR   Bit 0: Software reset
 * ETH_DMABMODE_DA   Bit 1: DMA Arbitration
 * ETH_DMABMODE_DSL  Bits 2-6: Descriptor skip length
 * ETH_DMABMODE_ATDS Bit 7: Enhanced descriptor format enable
 * ETH_DMABMODE_PBL  Bits 8-13: Programmable burst length
 * ETH_DMABMODE_RTPR Bits 14-15: RX TX priority ratio
 * ETH_DMABMODE_FB   Bit 16: Fixed burst
 * ETH_DMABMODE_RDP  Bits 17-22: RX DMA PBL
 * ETH_DMABMODE_USP  Bit 23: Use separate PBL
 * ETH_DMABMODE_FPM  Bit 24: 4xPBL mode
 * ETH_DMABMODE_AAB  Bit 25: Address-aligned beats
 * ETH_DMABMODE_MB   Bit 26: Mixed burst (F2/F4 only)
 */

