apache/nuttx/arch/arm/src/lpc43xx/lpc43_ethernet.c
#define DMABMR_CLEAR_MASK \
  (ETH_DMABMODE_SWR | ETH_DMABMODE_DA | ETH_DMABMODE_DSL_MASK | ETH_DMABMODE_ATDS | \
   ETH_DMABMODE_PBL_MASK | ETH_DMABMODE_PR_MASK | ETH_DMABMODE_FB | ETH_DMABMODE_RPBL_MASK | \
   ETH_DMABMODE_USP | ETH_DMABMODE_PBL8X | ETH_DMABMODE_AAL | ETH_DMABMODE_MB | ETH_DMABMODE_TXPR)

/* The following bits are set or left zero unconditionally in all modes.
 *
 *
 * ETH_DMABMODE_SR   Software reset             0 (no reset)
 * ETH_DMABMODE_DA   DMA Arbitration            0 (round robin)
 * ETH_DMABMODE_DSL  Descriptor skip length     0
 * ETH_DMABMODE_ATDS Enhanced descriptor format Depends on
 * enable                                       CONFIG_LPC43_ETH_ENHANCEDDESC
 * ETH_DMABMODE_PBL  Programmable burst length  32 beats
 * ETH_DMABMODE_RTPR RX TX priority ratio       2:1
 * ETH_DMABMODE_FB   Fixed burst                1 (enabled)
 * ETH_DMABMODE_RDP  RX DMA PBL                 32 beats
 * ETH_DMABMODE_USP  Use separate PBL           1 (enabled)
 * ETH_DMABMODE_FPM  4xPBL mode                 0 (disabled)
 * ETH_DMABMODE_AAB  Address-aligned beats      1 (enabled)
 * ETH_DMABMODE_MB   Mixed burst                0 (disabled, F2/F4 only)
 */

#ifdef CONFIG_LPC43_ETH_ENHANCEDDESC
#  define DMABMR_SET_MASK \
     (ETH_DMABMODE_DSL(0) | ETH_DMABMODE_PBL(32) | ETH_DMABMODE_ATDS | ETH_DMABMODE_RTPR_2TO1 | \
      ETH_DMABMODE_FB | ETH_DMABMODE_RPBL(32) | ETH_DMABMODE_USP | ETH_DMABMODE_AAB)
#else
#  define DMABMR_SET_MASK \
     (ETH_DMABMODE_DSL(0) | ETH_DMABMODE_PBL(32) | ETH_DMABMODE_PR_2TO1 | ETH_DMABMODE_FB | \
      ETH_DMABMODE_RPBL(32) | ETH_DMABMODE_USP | ETH_DMABMODE_AAL)
#endif

/* Interrupt bit sets *******************************************************/

/* All interrupts in the normal and abnormal interrupt summary. Early
 * transmit interrupt (ETI) is excluded from the abnormal set because it
 * causes too many interrupts and is not interesting.
 */

#define ETH_DMAINT_NORMAL \
  (ETH_DMAINT_TI | ETH_DMAINT_TU | ETH_DMAINT_RI | ETH_DMAINT_ERI)

#define ETH_DMAINT_ABNORMAL \
  (ETH_DMAINT_TPS | ETH_DMAINT_TJT | ETH_DMAINT_OVF | ETH_DMAINT_UNF | \
   ETH_DMAINT_RU | ETH_DMAINT_RPS | ETH_DMAINT_RWT | /* ETH_DMAINT_ETI | */ \
   ETH_DMAINT_FBI)

/* Normal receive, transmit, error interrupt enable bit sets */

#define ETH_DMAINT_RECV_ENABLE    (ETH_DMAINT_NIS | ETH_DMAINT_RI)
#define ETH_DMAINT_XMIT_ENABLE    (ETH_DMAINT_NIS | ETH_DMAINT_TI)
#define ETH_DMAINT_XMIT_DISABLE   (ETH_DMAINT_TI)

#ifdef CONFIG_DEBUG_NET
#  define ETH_DMAINT_ERROR_ENABLE (ETH_DMAINT_AIS | ETH_DMAINT_ABNORMAL)
#else
#  define ETH_DMAINT_ERROR_ENABLE (0)
#endif

/* Helpers ******************************************************************/

/* This is a helper pointer for accessing the contents of the Ethernet
 * header
 */

#define BUF ((struct eth_hdr_s *)priv->dev.d_buf)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* The lpc43_ethmac_s encapsulates all state information for a single
 * hardware interface
 */

struct lpc43_ethmac_s
{
  uint8_t              ifup    : 1; /* true:ifup false:ifdown */
  uint8_t              mbps100 : 1; /* 100MBps operation (vs 10 MBps) */
  uint8_t              fduplex : 1; /* Full (vs. half) duplex */
  struct wdog_s        txtimeout;   /* TX timeout timer */
  struct work_s        irqwork;     /* For deferring work to the work queue */
  struct work_s        pollwork;    /* For deferring work to the work queue */

  /* This holds the information visible to the NuttX network */

  struct net_driver_s  dev;         /* Interface understood by the network */

  /* Used to track transmit and receive descriptors */

  struct eth_txdesc_s *txhead;      /* Next available TX descriptor */
  struct eth_rxdesc_s *rxhead;      /* Next available RX descriptor */

  struct eth_txdesc_s *txtail;      /* First "in_flight" TX descriptor */
  struct eth_rxdesc_s *rxcurr;      /* First RX descriptor of the segment */
  uint16_t             segments;    /* RX segment count */
  uint16_t             inflight;    /* Number of TX transfers "in_flight" */
  sq_queue_t           freeb;       /* The free buffer list */

  /* Descriptor allocations */

  struct eth_rxdesc_s rxtable[CONFIG_LPC43_ETH_NRXDESC];
  struct eth_txdesc_s txtable[CONFIG_LPC43_ETH_NTXDESC];

  /* Buffer allocations */

  uint8_t rxbuffer[CONFIG_LPC43_ETH_NRXDESC*CONFIG_LPC43_ETH_BUFSIZE];
  uint8_t alloc[LPC43_ETH_NFREEBUFFERS*CONFIG_LPC43_ETH_BUFSIZE];
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

static struct lpc43_ethmac_s g_lpc43ethmac;

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register operations ******************************************************/

#ifdef CONFIG_LPC43_ETHMAC_REGDEBUG
static uint32_t lpc43_getreg(uint32_t addr);
static void lpc43_putreg(uint32_t val, uint32_t addr);
static void lpc43_checksetup(void);
#else
#  define lpc43_getreg(addr)     getreg32(addr)
#  define lpc43_putreg(val,addr) putreg32(val,addr)
#  define lpc43_checksetup()
#endif

/* Free buffer management */

static void lpc43_initbuffer(struct lpc43_ethmac_s *priv);
static inline uint8_t *lpc43_allocbuffer(struct lpc43_ethmac_s *priv);
static inline void lpc43_freebuffer(struct lpc43_ethmac_s *priv,
              uint8_t *buffer);
static inline bool lpc43_isfreebuffer(struct lpc43_ethmac_s *priv);

/* Common TX logic */

static int  lpc43_transmit(struct lpc43_ethmac_s *priv);
static int  lpc43_txpoll(struct net_driver_s *dev);
static void lpc43_dopoll(struct lpc43_ethmac_s *priv);

/* Interrupt handling */

static void lpc43_enableint(struct lpc43_ethmac_s *priv,
              uint32_t ierbit);
static void lpc43_disableint(struct lpc43_ethmac_s *priv,
              uint32_t ierbit);

static void lpc43_freesegment(struct lpc43_ethmac_s *priv,
              struct eth_rxdesc_s *rxfirst, int segments);
static int  lpc43_recvframe(struct lpc43_ethmac_s *priv);
static void lpc43_receive(struct lpc43_ethmac_s *priv);
static void lpc43_freeframe(struct lpc43_ethmac_s *priv);
static void lpc43_txdone(struct lpc43_ethmac_s *priv);

static void lpc43_interrupt_work(void *arg);
static int  lpc43_interrupt(int irq, void *context, void *arg);

/* Watchdog timer expirations */

static void lpc43_txtimeout_work(void *arg);
static void lpc43_txtimeout_expiry(wdparm_t arg);

/* NuttX callback functions */

static int  lpc43_ifup(struct net_driver_s *dev);
static int  lpc43_ifdown(struct net_driver_s *dev);

static void lpc43_txavail_work(void *arg);
static int  lpc43_txavail(struct net_driver_s *dev);

