apache/nuttx/arch/arm/src/lpc43xx/lpc43_ethernet.c
  DEBUGASSERT(priv);

  /* Get the DMA interrupt status bits (no MAC interrupts are expected) */

  net_lock();
  dmasr = lpc43_getreg(LPC43_ETH_DMASTAT);

  /* Mask only enabled interrupts.  This depends on the fact that the
   * interrupt related bits (0-16) correspond in these two registers.
   */

  dmasr &= lpc43_getreg(LPC43_ETH_DMAINTEN);

  /* Check if there are pending "normal" interrupts */

  if ((dmasr & ETH_DMAINT_NIS) != 0)
    {
      /* Yes.. Check if we received an incoming packet, if so, call
       * lpc43_receive()
       */

      if ((dmasr & ETH_DMAINT_RI) != 0)
        {
          /* Clear the pending receive interrupt */

          lpc43_putreg(ETH_DMAINT_RI, LPC43_ETH_DMASTAT);

          /* Handle the received package */

          lpc43_receive(priv);
        }

      /* Check if a packet transmission just completed.  If so, call
       * lpc43_txdone(). This may disable further TX interrupts if there
       * are no pending tansmissions.
       */

      if ((dmasr & ETH_DMAINT_TI) != 0)
        {
          /* Clear the pending receive interrupt */

          lpc43_putreg(ETH_DMAINT_TI, LPC43_ETH_DMASTAT);

          /* Check if there are pending transmissions */

          lpc43_txdone(priv);
        }

      /* Clear the pending normal summary interrupt */

      lpc43_putreg(ETH_DMAINT_NIS, LPC43_ETH_DMASTAT);
    }

  /* Handle error interrupt only if CONFIG_DEBUG_NET is enabled */

#ifdef CONFIG_DEBUG_NET
  /* Check if there are pending "abnormal" interrupts */

  if ((dmasr & ETH_DMAINT_AIS) != 0)
    {
      /* Just let the user know what happened */

      nerr("ERROR: Abnormal event(s): %08x\n", dmasr);

      /* Clear all pending abnormal events */

      lpc43_putreg(ETH_DMAINT_ABNORMAL, LPC43_ETH_DMASTAT);

      /* Clear the pending abnormal summary interrupt */

      lpc43_putreg(ETH_DMAINT_AIS, LPC43_ETH_DMASTAT);
    }
#endif /* CONFIG_DEBUG_NET */

  net_unlock();

  /* Re-enable Ethernet interrupts at the NVIC */

  up_enable_irq(LPC43M4_IRQ_ETHERNET);
}

/****************************************************************************
 * Function: lpc43_interrupt
 *
 * Description:
 *   Hardware interrupt handler
 *
 * Input Parameters:
 *   irq     - Number of the IRQ that generated the interrupt
 *   context - Interrupt register state save info (architecture-specific)
 *
 * Returned Value:
 *   OK on success
 *
 * Assumptions:
 *
 ****************************************************************************/

static int lpc43_interrupt(int irq, void *context, void *arg)
{
  struct lpc43_ethmac_s *priv = &g_lpc43ethmac;
  uint32_t dmasr;

  /* Get the DMA interrupt status bits (no MAC interrupts are expected) */

  dmasr = lpc43_getreg(LPC43_ETH_DMASTAT);
  if (dmasr != 0)
    {
      /* Disable further Ethernet interrupts.  Because Ethernet interrupts
       * are also disabled if the TX timeout event occurs, there can be no
       * race condition here.
       */

      up_disable_irq(LPC43M4_IRQ_ETHERNET);

      /* Check if a packet transmission just completed. */

      if ((dmasr & ETH_DMAINT_TI) != 0)
        {
          /* If a TX transfer just completed, then cancel the TX timeout so
           * there will be no race condition between any subsequent timeout
           * expiration and the deferred interrupt processing.
           */

           wd_cancel(&priv->txtimeout);
        }

      /* Schedule to perform the interrupt processing on the worker thread. */

      work_queue(ETHWORK, &priv->irqwork, lpc43_interrupt_work, priv, 0);
    }

  return OK;
}

/****************************************************************************
 * Function: lpc43_txtimeout_work
 *
 * Description:
 *   Perform TX timeout related work from the worker thread
 *
 * Input Parameters:
 *   arg - The argument passed when work_queue() as called.
 *
 * Returned Value:
 *   OK on success
 *
 * Assumptions:
 *   Ethernet interrupts are disabled
 *
 ****************************************************************************/

static void lpc43_txtimeout_work(void *arg)
{
  struct lpc43_ethmac_s *priv = (struct lpc43_ethmac_s *)arg;

  /* Then reset the hardware.  Just take the interface down, then back
   * up again.
   */

  net_lock();
  lpc43_ifdown(&priv->dev);
  lpc43_ifup(&priv->dev);

  /* Then poll the network for new XMIT data */

  lpc43_dopoll(priv);
  net_unlock();
}

/****************************************************************************
 * Function: lpc43_txtimeout_expiry
 *
 * Description:
 *   Our TX watchdog timed out.  Called from the timer interrupt handler.
 *   The last TX never completed.  Reset the hardware and start again.
 *
 * Input Parameters:
 *   arg  - The argument
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Global interrupts are disabled by the watchdog logic.
 *
 ****************************************************************************/

static void lpc43_txtimeout_expiry(wdparm_t arg)
{
  struct lpc43_ethmac_s *priv = (struct lpc43_ethmac_s *)arg;

  ninfo("Timeout!\n");

  /* Disable further Ethernet interrupts.  This will prevent some race
   * conditions with interrupt work.  There is still a potential race
   * condition with interrupt work that is already queued and in progress.
   *
   * Interrupts will be re-enabled when lpc43_ifup() is called.
   */

  up_disable_irq(LPC43M4_IRQ_ETHERNET);

  /* Schedule to perform the TX timeout processing on the worker thread,
   * perhaps cancelling any pending IRQ processing.
   */

  work_queue(ETHWORK, &priv->irqwork, lpc43_txtimeout_work, priv, 0);
}

/****************************************************************************
 * Function: lpc43_ifup
 *
 * Description:
 *   NuttX Callback: Bring up the Ethernet interface when an IP address is
 *   provided
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static int lpc43_ifup(struct net_driver_s *dev)
{
  struct lpc43_ethmac_s *priv =
    (struct lpc43_ethmac_s *)dev->d_private;
  int ret;

