apache/nuttx/arch/arm/src/lpc43xx/lpc43_ethernet.c
#else /* Auto-negotiation not selected */

#ifdef CONFIG_LPC43_ETHFD
  priv->fduplex = 1;
#endif

#ifdef CONFIG_LPC43_ETH100MBPS
  priv->mbps100 = 1;
#endif

  phyval = 0;

  if (priv->mbps100)
    {
      phyval |= MII_MCR_FULLDPLX;
    }

  if (priv->fduplex)
    {
      phyval |= MII_MCR_SPEED100;
    }

  ret = lpc43_phywrite(CONFIG_LPC43_PHYADDR, MII_MCR, phyval);
  if (ret < 0)
    {
     nerr("ERROR: Failed to write the PHY MCR: %d\n", ret);
      return ret;
    }

  up_mdelay(PHY_CONFIG_DELAY);

  /* Remember the selected speed and duplex modes
   * REVISIT:  Isn't this redundant?
   */

#ifdef CONFIG_LPC43_ETHFD
  priv->fduplex = 1;
#endif

#ifdef CONFIG_LPC43_ETH100MBPS
  priv->mbps100 = 1;
#endif
#endif

  ninfo("Duplex: %s Speed: %d MBps\n",
        priv->fduplex ? "FULL" : "HALF",
        priv->mbps100 ? 100 : 10);

  return OK;
}

/****************************************************************************
 * Name: lpc43_selectmii
 *
 * Description:
 *   Selects the MII interface.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

#ifdef CONFIG_LPC43_MII
static inline void lpc43_selectmii(void)
{
  uint32_t regval;

  regval  = getreg32(LPC43_CREG6);
  regval &= ~SYSCFG_PMC_MII_RMII_SEL;
  putreg32(regval, LPC43_CREG6);
}
#endif

/****************************************************************************
 * Name: lpc43_selectrmii
 *
 * Description:
 *   Selects the RMII interface.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void lpc43_selectrmii(void)
{
  uint32_t regval;

  regval  = getreg32(LPC43_CREG6);
  regval |= CREG6_ETHMODE_RMII;
  putreg32(regval, LPC43_CREG6);
}

/****************************************************************************
 * Function: lpc43_ethgpioconfig
 *
 * Description:
 *  Configure GPIOs for the Ethernet interface.
 *
 * Input Parameters:
 *   priv - A reference to the private driver state structure
 *
 * Returned Value:
 *   None.
 *
 * Assumptions:
 *
 ****************************************************************************/

static inline void lpc43_ethgpioconfig(struct lpc43_ethmac_s *priv)
{
  /* Configure GPIO pins to support Ethernet */

#if defined(CONFIG_LPC43_MII) || defined(CONFIG_LPC43_RMII)
  /* MDC and MDIO are common to both modes */

  lpc43_pin_config(PINCONF_ENET_MDC);
  lpc43_pin_config(PINCONF_ENET_MDIO);

  /* Set up the MII interface */

#if defined(CONFIG_LPC43_MII)
  /* Select the MII interface */

  lpc43_selectmii();

  /* MII interface pins (17):
   *
   * MII_TX_CLK, MII_TXD[3:0], MII_TX_EN, MII_RX_CLK, MII_RXD[3:0],
   * MII_RX_ER, MII_RX_DV, MII_CRS, MII_COL, MDC, MDIO
   */

  lpc43_pin_config(PINCONF_ENET_MII_COL);
  lpc43_pin_config(PINCONF_ENET_MII_CRS);
  lpc43_pin_config(PINCONF_ENET_MII_RXD0);
  lpc43_pin_config(PINCONF_ENET_MII_RXD1);
  lpc43_pin_config(PINCONF_ENET_MII_RXD2);
  lpc43_pin_config(PINCONF_ENET_MII_RXD3);
  lpc43_pin_config(PINCONF_ENET_MII_RX_CLK);
  lpc43_pin_config(PINCONF_ENET_MII_RX_DV);
  lpc43_pin_config(PINCONF_ENET_MII_RX_ER);
  lpc43_pin_config(PINCONF_ENET_MII_TXD0);
  lpc43_pin_config(PINCONF_ENET_MII_TXD1);
  lpc43_pin_config(PINCONF_ENET_MII_TXD2);
  lpc43_pin_config(PINCONF_ENET_MII_TXD3);
  lpc43_pin_config(PINCONF_ENET_MII_TX_CLK);
  lpc43_pin_config(PINCONF_ENET_MII_TX_EN);
  lpc43_pin_config(PINCONF_ENET_MII_TX_ER);

  /* Set up the RMII interface. */

#elif defined(CONFIG_LPC43_RMII)
  /* Select the RMII interface */

  lpc43_selectrmii();

  /* RMII interface pins (7):
   *
   * RMII_TXD[1:0], RMII_TX_EN, RMII_RXD[1:0], RMII_CRS_DV, MDC, MDIO,
   * RMII_REF_CLK
   */

  lpc43_pin_config(PINCONF_ENET_RX_DV);
  lpc43_pin_config(PINCONF_ENET_REF_CLK);
  lpc43_pin_config(PINCONF_ENET_RXD0);
  lpc43_pin_config(PINCONF_ENET_RXD1);
  lpc43_pin_config(PINCONF_ENET_TXD0);
  lpc43_pin_config(PINCONF_ENET_TXD1);
  lpc43_pin_config(PINCONF_ENET_TX_EN);

#ifdef PINCONF_ENET_RESET
  lpc43_pin_config(PINCONF_ENET_RESET);
  lpc43_gpio_config(GPIO_ENET_RESET);
  lpc43_gpio_write(GPIO_ENET_RESET, 0);
  up_mdelay(5);
  lpc43_gpio_write(GPIO_ENET_RESET, 1);
  up_mdelay(5);
#endif
#endif
#endif
}

/****************************************************************************
 * Function: lpc43_ethreset
 *
 * Description:
 *  Reset the Ethernet block.
 *
 * Input Parameters:
 *   priv - A reference to the private driver state structure
 *
 * Returned Value:
 *   None.
 *
 * Assumptions:
 *
 ****************************************************************************/

static void lpc43_ethreset(struct lpc43_ethmac_s *priv)
{
  uint32_t regval;

  lpc43_putreg(CCU_CLK_CFG_RUN | CCU_CLK_CFG_AUTO | CCU_CLK_CFG_WAKEUP,
               LPC43_CCU1_M4_ETHERNET_CFG);

  /* Reset the Ethernet  */

  lpc43_putreg(RGU_CTRL0_ETHERNET_RST, LPC43_RGU_CTRL0);

  regval  = lpc43_getreg(LPC43_ETH_DMABMODE);
  regval |= ETH_DMABMODE_SWR;
  lpc43_putreg(regval, LPC43_ETH_DMABMODE);

  /* Wait for software reset to complete. The SR bit is cleared automatically
   * after the reset operation has completed in all core clock domains.
   */

  while ((lpc43_getreg(LPC43_ETH_DMABMODE) & ETH_DMABMODE_SWR) != 0);
}

/****************************************************************************
 * Function: lpc43_macconfig
 *
 * Description:
 *  Configure the Ethernet MAC for DMA operation.
 *
 * Input Parameters:
 *   priv - A reference to the private driver state structure
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

static int lpc43_macconfig(struct lpc43_ethmac_s *priv)
{
  uint32_t regval;

  /* Set up the MACCR register */

  regval  = lpc43_getreg(LPC43_ETH_MACCR);
  regval &= ~MACCR_CLEAR_BITS;
  regval |= MACCR_SET_BITS;

  if (priv->fduplex)
    {
      /* Set the DM bit for full duplex support */

      regval |= ETH_MACCFG_DM;
    }

  if (priv->mbps100)
    {
      /* Set the FES bit for 100Mbps fast ethernet support */

      regval |= ETH_MACCFG_FES;
    }

