apache/nuttx/arch/arm/src/lpc43xx/lpc43_ethernet.c
  lpc43_putreg(regval, LPC43_ETH_MACCR);

  /* Set up the MACFFR register */

  regval  = lpc43_getreg(LPC43_ETH_MACFFLT);
  regval &= ~MACFFR_CLEAR_BITS;
  regval |= MACFFR_SET_BITS;
  lpc43_putreg(regval, LPC43_ETH_MACFFLT);

  /* Set up the MACHTHR and MACHTLR registers */

  lpc43_putreg(0, LPC43_ETH_MACHTHI);
  lpc43_putreg(0, LPC43_ETH_MACHTLO);

  /* Setup up the MACFCR register */

  regval  = lpc43_getreg(LPC43_ETH_MACFC);
  regval &= ~MACFCR_CLEAR_MASK;
  regval |= MACFCR_SET_MASK;
  lpc43_putreg(regval, LPC43_ETH_MACFC);

  /* Setup up the MACVLANTR register */

  lpc43_putreg(0, LPC43_ETH_MACVLANT);

  /* DMA Configuration */

  /* Set up the DMAOMR register */

  regval  = lpc43_getreg(LPC43_ETH_DMAOPMODE);
  regval &= ~DMAOMR_CLEAR_MASK;
  regval |= DMAOMR_SET_MASK;
  lpc43_putreg(regval, LPC43_ETH_DMAOPMODE);

  /* Set up the DMABMR register */

  regval  = lpc43_getreg(LPC43_ETH_DMABMODE);
  regval &= ~DMABMR_CLEAR_MASK;
  regval |= DMABMR_SET_MASK;
  lpc43_putreg(regval, LPC43_ETH_DMABMODE);

  return OK;
}

/****************************************************************************
 * Function: lpc43_macaddress
 *
 * Description:
 *   Configure the selected MAC address.
 *
 * Input Parameters:
 *   priv - A reference to the private driver state structure
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

static void lpc43_macaddress(struct lpc43_ethmac_s *priv)
{
  struct net_driver_s *dev = &priv->dev;
  uint32_t regval;

  ninfo("%s MAC: %02x:%02x:%02x:%02x:%02x:%02x\n",
        dev->d_ifname,
        dev->d_mac.ether.ether_addr_octet[0],
        dev->d_mac.ether.ether_addr_octet[1],
        dev->d_mac.ether.ether_addr_octet[2],
        dev->d_mac.ether.ether_addr_octet[3],
        dev->d_mac.ether.ether_addr_octet[4],
        dev->d_mac.ether.ether_addr_octet[5]);

  /* Set the MAC address high register */

  regval = ((uint32_t)dev->d_mac.ether.ether_addr_octet[5] << 8) |
            (uint32_t)dev->d_mac.ether.ether_addr_octet[4];
  lpc43_putreg(regval, LPC43_ETH_MACA0HI);

  /* Set the MAC address low register */

  regval = ((uint32_t)dev->d_mac.ether.ether_addr_octet[3] << 24) |
           ((uint32_t)dev->d_mac.ether.ether_addr_octet[2] << 16) |
           ((uint32_t)dev->d_mac.ether.ether_addr_octet[1] <<  8) |
            (uint32_t)dev->d_mac.ether.ether_addr_octet[0];
  lpc43_putreg(regval, LPC43_ETH_MACA0LO);
}

/****************************************************************************
 * Function: lpc43_macenable
 *
 * Description:
 *  Enable normal MAC operation.
 *
 * Input Parameters:
 *   priv - A reference to the private driver state structure
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

static int lpc43_macenable(struct lpc43_ethmac_s *priv)
{
  uint32_t regval;

  /* Set the MAC address */

  lpc43_macaddress(priv);

  /* Enable transmit state machine of the MAC for transmission on the MII */

  regval  = lpc43_getreg(LPC43_ETH_MACCR);
  regval |= ETH_MACCFG_TE;
  lpc43_putreg(regval, LPC43_ETH_MACCR);

  /* Flush Transmit FIFO */

  regval  = lpc43_getreg(LPC43_ETH_DMAOPMODE);
  regval |= ETH_DMAOPMODE_FTF;
  lpc43_putreg(regval, LPC43_ETH_DMAOPMODE);

  /* Enable receive state machine of the MAC for reception from the MII */

  /* Enables or disables the MAC reception. */

  regval  = lpc43_getreg(LPC43_ETH_MACCR);
  regval |= ETH_MACCFG_RE;
  lpc43_putreg(regval, LPC43_ETH_MACCR);

  /* Start DMA transmission */

  regval  = lpc43_getreg(LPC43_ETH_DMAOPMODE);
  regval |= ETH_DMAOPMODE_ST;
  lpc43_putreg(regval, LPC43_ETH_DMAOPMODE);

  /* Start DMA reception */

  regval  = lpc43_getreg(LPC43_ETH_DMAOPMODE);
  regval |= ETH_DMAOPMODE_SR;
  lpc43_putreg(regval, LPC43_ETH_DMAOPMODE);

  /* Enable Ethernet DMA interrupts.
   *
   * The LPC43 hardware supports two interrupts: (1) one dedicated to normal
   * Ethernet operations and the other, used only for the Ethernet wakeup
   * event.  The wake-up interrupt is not used by this driver.
   *
   * The first Ethernet vector is reserved for interrupts generated by the
   * MAC and the DMA. The MAC provides PMT and time stamp trigger interrupts,
   * neither of which are used by this driver.
   */

  lpc43_putreg(ETH_MACIM_ALLINTS, LPC43_ETH_MACIM);

  /* Ethernet DMA supports two classes of interrupts: Normal interrupt
   * summary (NIS) and Abnormal interrupt summary (AIS) with a variety
   * individual normal and abnormal interrupting events.  Here only
   * the normal receive event is enabled (unless DEBUG is enabled).  Transmit
   * events will only be enabled when a transmit interrupt is expected.
   */

  lpc43_putreg((ETH_DMAINT_RECV_ENABLE | ETH_DMAINT_ERROR_ENABLE),
               LPC43_ETH_DMAINTEN);
  return OK;
}

/****************************************************************************
 * Function: lpc43_ethconfig
 *
 * Description:
 *  Configure the Ethernet interface for DMA operation.
 *
 * Input Parameters:
 *   priv - A reference to the private driver state structure
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

static int lpc43_ethconfig(struct lpc43_ethmac_s *priv)
{
  int ret;

  /* NOTE: The Ethernet clocks were initialized early in the boot-up
   * sequence in lpc43_rcc.c.
   */

  /* Reset the Ethernet block */

  ninfo("Reset the Ethernet block\n");
  lpc43_ethreset(priv);

  /* Initialize the PHY */

  ninfo("Initialize the PHY\n");
  ret = lpc43_phyinit(priv);
  if (ret < 0)
    {
      return ret;
    }

  /* Perform a software reset by setting the SR bit in the DMABMR register.
   * This Resets all MAC subsystem internal registers and logic.  After this
   * reset all the registers holds their reset values.
   */

  /* Initialize the MAC and DMA */

  ninfo("Initialize the MAC and DMA\n");
  ret = lpc43_macconfig(priv);
  if (ret < 0)
    {
      return ret;
    }

