apache/nuttx/arch/arm/src/lpc43xx/lpc43_ethernet.c
  /* Initialize the free buffer list */

  lpc43_initbuffer(priv);

  /* Initialize TX Descriptors list: Chain Mode */

  lpc43_txdescinit(priv);

  /* Initialize RX Descriptors list: Chain Mode  */

  lpc43_rxdescinit(priv);

  /* Enable normal MAC operation */

  ninfo("Enable normal operation\n");
  return lpc43_macenable(priv);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Function: lpc43_ethinitialize
 *
 * Description:
 *   Initialize the Ethernet driver for one interface.
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

static inline int lpc43_ethinitialize(void)
{
  struct lpc43_ethmac_s *priv;

  /* Get the interface structure associated with this interface number. */

  priv = &g_lpc43ethmac;

  /* Initialize the driver structure */

  memset(priv, 0, sizeof(struct lpc43_ethmac_s));
  priv->dev.d_ifup    = lpc43_ifup;     /* I/F up (new IP address) callback */
  priv->dev.d_ifdown  = lpc43_ifdown;   /* I/F down callback */
  priv->dev.d_txavail = lpc43_txavail;  /* New TX data callback */
#ifdef CONFIG_NET_MCASTGROUP
  priv->dev.d_addmac  = lpc43_addmac;   /* Add multicast MAC address */
  priv->dev.d_rmmac   = lpc43_rmmac;    /* Remove multicast MAC address */
#endif
#ifdef CONFIG_NETDEV_IOCTL
  priv->dev.d_ioctl   = lpc43_ioctl;    /* Support PHY ioctl() calls */
#endif
  priv->dev.d_private = &g_lpc43ethmac; /* Used to recover private state from dev */

  /* Configure GPIO pins to support Ethernet */

  lpc43_ethgpioconfig(priv);

  /* Attach the IRQ to the driver */

  if (irq_attach(LPC43M4_IRQ_ETHERNET, lpc43_interrupt, NULL))
    {
      /* We could not attach the ISR to the interrupt */

      return -EAGAIN;
    }

  /* Put the interface in the down state. */

  lpc43_ifdown(&priv->dev);

  /* Register the device with the OS so that socket IOCTLs can be performed */

  netdev_register(&priv->dev, NET_LL_ETHERNET);
  return OK;
}

/****************************************************************************
 * Function: arm_netinitialize
 *
 * Description:
 *   This is the "standard" network initialization logic called from the
 *   low-level initialization logic in arm_initialize.c.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 * Assumptions:
 *
 ****************************************************************************/

#ifndef CONFIG_NETDEV_LATEINIT
void arm_netinitialize(void)
{
  lpc43_ethinitialize();
}
#endif

#endif /* CONFIG_NET && CONFIG_LPC43_ETHERNET */
